Synwit-Co-Ltd/SWM261_Lib/SWM261_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM261.h
#define UART_CFG_MSBF_Pos			1		//接收发送MSB First
#define UART_CFG_MSBF_Msk			(0x01 << UART_CFG_MSBF_Pos)
#define UART_CFG_BRKTXLEN_Pos		2		//1表示1bit，以此类推，默认值13
#define UART_CFG_BRKTXLEN_Msk		(0x0F << UART_CFG_BRKTXLEN_Pos)
#define UART_CFG_BRKRXLEN_Pos		6		//0表示1bit，以此类推，默认值12
#define UART_CFG_BRKRXLEN_Msk		(0x0F << UART_CFG_BRKRXLEN_Pos)
#define UART_CFG_RXINV_Pos			10		//接收电平翻转
#define UART_CFG_RXINV_Msk			(0x01 << UART_CFG_RXINV_Pos)
#define UART_CFG_TXINV_Pos			11		//发送电平翻转
#define UART_CFG_TXINV_Msk			(0x01 << UART_CFG_TXINV_Pos)

#define UART_TOCR_TIME_Pos			0		//超时时间长度，单位为 10/BAUDRATE 秒
#define UART_TOCR_TIME_Msk			(0xFFF<< UART_TOCR_TIME_Pos)
#define UART_TOCR_MODE_Pos			12		//0 只有当FIFO中有数时才触发超时中断    1 即使FIFO中没有数也可触发超时中断
#define UART_TOCR_MODE_Msk			(0x01 << UART_TOCR_MODE_Pos)
#define UART_TOCR_IFCLR_Pos			13		//TO Interrupt Flag Clear，写1清除超时中断标志
#define UART_TOCR_IFCLR_Msk			(0x01 << UART_TOCR_IFCLR_Pos)




typedef struct {
	__O  uint32_t CR;
	
	__IO uint32_t MR;
	
	__O  uint32_t IER;						//Interrupt Enable Register
	
	__O  uint32_t IDR;						//Interrupt Disable Register
	
	__I  uint32_t IMR;						//Interrupt Enable value register
	
	__I  uint32_t ISR;
	
	__I  uint32_t RHR;						//Receiver Holding Register
	
	__O  uint32_t THR;						//Transmitter Holding Register
	
	__IO uint32_t BAUD;						//Baud Rate
	
	__IO uint32_t RXTO;						//Receiver Time-out, 1-65535 bit period
	
		 uint32_t RESERVED[11];
	
	__IO uint32_t LINMR;					//LIN Mode Register
	
	__IO uint32_t LINID;
	
	__I  uint32_t LINBR;					//LIN Baud Rate Register
} USART_TypeDef;


#define USART_CR_RSTRX_Pos			2		//Reset Receiver
#define USART_CR_RSTRX_Msk			(0x01 << USART_CR_RSTRX_Pos)
#define USART_CR_RSTTX_Pos			3		//Reset Transmitter
#define USART_CR_RSTTX_Msk			(0x01 << USART_CR_RSTTX_Pos)
#define USART_CR_RXEN_Pos			4		//Receiver Enable
#define USART_CR_RXEN_Msk			(0x01 << USART_CR_RXEN_Pos)
#define USART_CR_RXDIS_Pos			5		//Receiver Disable
#define USART_CR_RXDIS_Msk			(0x01 << USART_CR_RXDIS_Pos)
#define USART_CR_TXEN_Pos			6		//Transmitter Enable
#define USART_CR_TXEN_Msk			(0x01 << USART_CR_TXEN_Pos)
#define USART_CR_TXDIS_Pos			7		//Transmitter Disable
#define USART_CR_TXDIS_Msk			(0x01 << USART_CR_TXDIS_Pos)
#define USART_CR_RSTSTA_Pos			8		//Reset Status Bits
#define USART_CR_RSTSTA_Msk			(0x01 << USART_CR_RSTSTA_Pos)
#define USART_CR_STTBRK_Pos			9		//Start Break
#define USART_CR_STTBRK_Msk			(0x01 << USART_CR_STTBRK_Pos)
#define USART_CR_STPBRK_Pos			10		//Stop Break
#define USART_CR_STPBRK_Msk			(0x01 << USART_CR_STPBRK_Pos)
#define USART_CR_STTTO_Pos			11		//Start Time-out
#define USART_CR_STTTO_Msk			(0x01 << USART_CR_STTTO_Pos)
#define USART_CR_RETTO_Pos			15		//Rearm Time-out
#define USART_CR_RETTO_Msk			(0x01 << USART_CR_RETTO_Pos)
#define USART_CR_LINABT_Pos			20		//Abort the current LIN transmission.
#define USART_CR_LINABT_Msk			(0x01 << USART_CR_LINABT_Pos)
#define USART_CR_LINWKUP_Pos		21		//Sends a wakeup signal on the LIN bus.
#define USART_CR_LINWKUP_Msk		(0x01 << USART_CR_LINWKUP_Pos)

#define USART_MR_MODE_Pos			0		//0 UART   10 LIN Master   11 LIN Slave
#define USART_MR_MODE_Msk			(0x0F << USART_MR_MODE_Pos)
#define USART_MR_CLKS_Pos			4		//Clock source
#define USART_MR_CLKS_Msk			(0x03 << USART_MR_CLKS_Pos)
#define USART_MR_NBDATA_Pos			6		//Number of Data bits, 0 5bit   1 6bit   2 7bit   3 8bit
#define USART_MR_NBDATA_Msk			(0x03 << USART_MR_NBDATA_Pos)
#define USART_MR_PARITY_Pos			9		//0 Even parity   1 Odd parity   2 force 0   3 force 1   4 No parity   6 Multidrop mode
#define USART_MR_PARITY_Msk			(0x07 << USART_MR_PARITY_Pos)
#define USART_MR_NBSTOP_Pos			12		//Number of Stop bits, 0 1bit   1 1.5bit   2 2bit
#define USART_MR_NBSTOP_Msk			(0x03 << USART_MR_NBSTOP_Pos)
#define USART_MR_MSBF_Pos			16		//MSB first
#define USART_MR_MSBF_Msk			(0x01 << USART_MR_MSBF_Pos)
#define USART_MR_DATA9b_Pos			17		//1 9-bit data length
#define USART_MR_DATA9b_Msk			(0x01 << USART_MR_DATA9b_Pos)
#define USART_MR_OVER8_Pos			19		//0 16x Oversampling   1 8x Oversampling
#define USART_MR_OVER8_Msk			(0x01 << USART_MR_OVER8_Pos)

#define USART_IER_RXRDY_Pos			0
#define USART_IER_RXRDY_Msk			(0x01 << USART_IER_RXRDY_Pos)
#define USART_IER_TXRDY_Pos			1
#define USART_IER_TXRDY_Msk			(0x01 << USART_IER_TXRDY_Pos)
#define USART_IER_RXBRK_Pos			2
#define USART_IER_RXBRK_Msk			(0x01 << USART_IER_RXBRK_Pos)
#define USART_IER_OVRERR_Pos		5
#define USART_IER_OVRERR_Msk		(0x01 << USART_IER_OVRERR_Pos)
#define USART_IER_FRAMERR_Pos		6
#define USART_IER_FRAMERR_Msk		(0x01 << USART_IER_FRAMERR_Pos)
#define USART_IER_PARITYERR_Pos		7
#define USART_IER_PARITYERR_Msk		(0x01 << USART_IER_PARITYERR_Pos)
#define USART_IER_RXTO_Pos			8
#define USART_IER_RXTO_Msk			(0x01 << USART_IER_RXTO_Pos)
#define USART_IER_TXEMPTY_Pos		9
#define USART_IER_TXEMPTY_Msk		(0x01 << USART_IER_TXEMPTY_Pos)
#define USART_IER_TXBEMPTY_Pos		11
#define USART_IER_TXBEMPTY_Msk		(0x01 << USART_IER_TXBEMPTY_Pos)
#define USART_IER_RXBFULL_Pos		12
#define USART_IER_RXBFULL_Msk		(0x01 << USART_IER_RXBFULL_Pos)
#define USART_IER_BRK_Pos			13
#define USART_IER_BRK_Msk			(0x01 << USART_IER_BRK_Pos)
#define USART_IER_ID_Pos			14
#define USART_IER_ID_Msk			(0x01 << USART_IER_ID_Pos)
#define USART_IER_DONE_Pos			15
#define USART_IER_DONE_Msk			(0x01 << USART_IER_DONE_Pos)
#define USART_IER_BITERR_Pos		25
#define USART_IER_BITERR_Msk		(0x01 << USART_IER_BITERR_Pos)
#define USART_IER_SYNCERR_Pos		26
#define USART_IER_SYNCERR_Msk		(0x01 << USART_IER_SYNCERR_Pos)
#define USART_IER_IDERR_Pos			27
#define USART_IER_IDERR_Msk			(0x01 << USART_IER_IDERR_Pos)
#define USART_IER_CHKERR_Pos		28
#define USART_IER_CHKERR_Msk		(0x01 << USART_IER_CHKERR_Pos)
#define USART_IER_NAKERR_Pos		29
#define USART_IER_NAKERR_Msk		(0x01 << USART_IER_NAKERR_Pos)
#define USART_IER_HDRTO_Pos			31
#define USART_IER_HDRTO_Msk			(0x01 << USART_IER_HDRTO_Pos)

#define USART_IDR_RXRDY_Pos			0
#define USART_IDR_RXRDY_Msk			(0x01 << USART_IDR_RXRDY_Pos)
#define USART_IDR_TXRDY_Pos			1
#define USART_IDR_TXRDY_Msk			(0x01 << USART_IDR_TXRDY_Pos)
#define USART_IDR_RXBRK_Pos			2
#define USART_IDR_RXBRK_Msk			(0x01 << USART_IDR_RXBRK_Pos)
#define USART_IDR_OVRERR_Pos		5
#define USART_IDR_OVRERR_Msk		(0x01 << USART_IDR_OVRERR_Pos)
#define USART_IDR_FRAMERR_Pos		6
#define USART_IDR_FRAMERR_Msk		(0x01 << USART_IDR_FRAMERR_Pos)
#define USART_IDR_PARITYERR_Pos		7
#define USART_IDR_PARITYERR_Msk		(0x01 << USART_IDR_PARITYERR_Pos)
#define USART_IDR_RXTO_Pos			8
#define USART_IDR_RXTO_Msk			(0x01 << USART_IDR_RXTO_Pos)
#define USART_IDR_TXEMPTY_Pos		9
#define USART_IDR_TXEMPTY_Msk		(0x01 << USART_IDR_TXEMPTY_Pos)
#define USART_IDR_TXBEMPTY_Pos		11
#define USART_IDR_TXBEMPTY_Msk		(0x01 << USART_IDR_TXBEMPTY_Pos)
#define USART_IDR_RXBFULL_Pos		12
#define USART_IDR_RXBFULL_Msk		(0x01 << USART_IDR_RXBFULL_Pos)
#define USART_IDR_BRK_Pos			13
#define USART_IDR_BRK_Msk			(0x01 << USART_IDR_BRK_Pos)
#define USART_IDR_ID_Pos			14
#define USART_IDR_ID_Msk			(0x01 << USART_IDR_ID_Pos)
#define USART_IDR_DONE_Pos			15
#define USART_IDR_DONE_Msk			(0x01 << USART_IDR_DONE_Pos)
#define USART_IDR_BITERR_Pos		25
#define USART_IDR_BITERR_Msk		(0x01 << USART_IDR_BITERR_Pos)
#define USART_IDR_SYNCERR_Pos		26
#define USART_IDR_SYNCERR_Msk		(0x01 << USART_IDR_SYNCERR_Pos)
#define USART_IDR_IDERR_Pos			27
#define USART_IDR_IDERR_Msk			(0x01 << USART_IDR_IDERR_Pos)
#define USART_IDR_CHKERR_Pos		28
#define USART_IDR_CHKERR_Msk		(0x01 << USART_IDR_CHKERR_Pos)
#define USART_IDR_NAKERR_Pos		29
#define USART_IDR_NAKERR_Msk		(0x01 << USART_IDR_NAKERR_Pos)
#define USART_IDR_HDRTO_Pos			31
#define USART_IDR_HDRTO_Msk			(0x01 << USART_IDR_HDRTO_Pos)

#define USART_IMR_RXRDY_Pos			0
#define USART_IMR_RXRDY_Msk			(0x01 << USART_IMR_RXRDY_Pos)
#define USART_IMR_TXRDY_Pos			1
#define USART_IMR_TXRDY_Msk			(0x01 << USART_IMR_TXRDY_Pos)
#define USART_IMR_RXBRK_Pos			2
#define USART_IMR_RXBRK_Msk			(0x01 << USART_IMR_RXBRK_Pos)
#define USART_IMR_OVRERR_Pos		5
#define USART_IMR_OVRERR_Msk		(0x01 << USART_IMR_OVRERR_Pos)
#define USART_IMR_FRAMERR_Pos		6
#define USART_IMR_FRAMERR_Msk		(0x01 << USART_IMR_FRAMERR_Pos)
#define USART_IMR_PARITYERR_Pos		7
#define USART_IMR_PARITYERR_Msk		(0x01 << USART_IMR_PARITYERR_Pos)
#define USART_IMR_RXTO_Pos			8
#define USART_IMR_RXTO_Msk			(0x01 << USART_IMR_RXTO_Pos)
#define USART_IMR_TXEMPTY_Pos		9
#define USART_IMR_TXEMPTY_Msk		(0x01 << USART_IMR_TXEMPTY_Pos)
#define USART_IMR_TXBEMPTY_Pos		11
#define USART_IMR_TXBEMPTY_Msk		(0x01 << USART_IMR_TXBEMPTY_Pos)
#define USART_IMR_RXBFULL_Pos		12
#define USART_IMR_RXBFULL_Msk		(0x01 << USART_IMR_RXBFULL_Pos)
#define USART_IMR_BRK_Pos			13
#define USART_IMR_BRK_Msk			(0x01 << USART_IMR_BRK_Pos)
#define USART_IMR_ID_Pos			14
#define USART_IMR_ID_Msk			(0x01 << USART_IMR_ID_Pos)
#define USART_IMR_DONE_Pos			15
#define USART_IMR_DONE_Msk			(0x01 << USART_IMR_DONE_Pos)
#define USART_IMR_BITERR_Pos		25
#define USART_IMR_BITERR_Msk		(0x01 << USART_IMR_BITERR_Pos)
#define USART_IMR_SYNCERR_Pos		26
#define USART_IMR_SYNCERR_Msk		(0x01 << USART_IMR_SYNCERR_Pos)
#define USART_IMR_IDERR_Pos			27
#define USART_IMR_IDERR_Msk			(0x01 << USART_IMR_IDERR_Pos)
#define USART_IMR_CHKERR_Pos		28
#define USART_IMR_CHKERR_Msk		(0x01 << USART_IMR_CHKERR_Pos)
#define USART_IMR_NAKERR_Pos		29
#define USART_IMR_NAKERR_Msk		(0x01 << USART_IMR_NAKERR_Pos)
#define USART_IMR_HDRTO_Pos			31
#define USART_IMR_HDRTO_Msk			(0x01 << USART_IMR_HDRTO_Pos)

#define USART_ISR_RXRDY_Pos			0		//RHR 中有数据，读 RHR 清零
#define USART_ISR_RXRDY_Msk			(0x01 << USART_ISR_RXRDY_Pos)
#define USART_ISR_TXRDY_Pos			1		//THR 中无数据，写 THR 清零
#define USART_ISR_TXRDY_Msk			(0x01 << USART_ISR_TXRDY_Pos)
#define USART_ISR_RXBRK_Pos			2		//Break Received or End of Break detected, CR.RSTSTA 写 1 清零
#define USART_ISR_RXBRK_Msk			(0x01 << USART_ISR_RXBRK_Pos)
#define USART_ISR_OVRERR_Pos		5		//溢出错误，CR.RSTSTA 写 1 清零
#define USART_ISR_OVRERR_Msk		(0x01 << USART_ISR_OVRERR_Pos)
#define USART_ISR_FRAMERR_Pos		6		//帧格式错误，CR.RSTSTA 写 1 清零
#define USART_ISR_FRAMERR_Msk		(0x01 << USART_ISR_FRAMERR_Pos)
#define USART_ISR_PARITYERR_Pos		7		//校验位错误，CR.RSTSTA 写 1 清零
#define USART_ISR_PARITYERR_Msk		(0x01 << USART_ISR_PARITYERR_Pos)
#define USART_ISR_RXTO_Pos			8		//接收超时错误，CR.STTTO 写 1 清零
#define USART_ISR_RXTO_Msk			(0x01 << USART_ISR_RXTO_Pos)
#define USART_ISR_TXEMPTY_Pos		9		//THR 和发送移位寄存器中皆无数据，写 THR 清零
#define USART_ISR_TXEMPTY_Msk		(0x01 << USART_ISR_TXEMPTY_Pos)
#define USART_ISR_TXBEMPTY_Pos		11
#define USART_ISR_TXBEMPTY_Msk		(0x01 << USART_ISR_TXBEMPTY_Pos)
#define USART_ISR_RXBFULL_Pos		12
#define USART_ISR_RXBFULL_Msk		(0x01 << USART_ISR_RXBFULL_Pos)
#define USART_ISR_BRK_Pos			13		//LIN Break Sent or LIN Break Received, CR.RSTSTA 写 1 清零
#define USART_ISR_BRK_Msk			(0x01 << USART_ISR_BRK_Pos)
#define USART_ISR_ID_Pos			14		//LIN Identifier Sent or LIN Identifier Received, CR.RSTSTA 写 1 清零
#define USART_ISR_ID_Msk			(0x01 << USART_ISR_ID_Pos)
#define USART_ISR_DONE_Pos			15		//LIN Transfer Completed, CR.RSTSTA 写 1 清零
#define USART_ISR_DONE_Msk			(0x01 << USART_ISR_DONE_Pos)
#define USART_ISR_BUSSTA_Pos		23		//LIN Bus Line Status
#define USART_ISR_BUSSTA_Msk		(0x01 << USART_ISR_BUSSTA_Pos)
#define USART_ISR_BITERR_Pos		25		//A Bit Error has been detected, CR.RSTSTA 写 1 清零
#define USART_ISR_BITERR_Msk		(0x01 << USART_ISR_BITERR_Pos)
#define USART_ISR_SYNCERR_Pos		26		//LIN Slave 模式下，a LIN Inconsistent Synch Field Error has been detected, CR.RSTSTA 写 1 清零
#define USART_ISR_SYNCERR_Msk		(0x01 << USART_ISR_SYNCERR_Pos)
#define USART_ISR_IDERR_Pos			27		//A LIN Identifier Parity Error has been detected, CR.RSTSTA 写 1 清零
#define USART_ISR_IDERR_Msk			(0x01 << USART_ISR_IDERR_Pos)
#define USART_ISR_CHKERR_Pos		28		//A LIN Checksum Error has been detected, CR.RSTSTA 写 1 清零
#define USART_ISR_CHKERR_Msk		(0x01 << USART_ISR_CHKERR_Pos)
#define USART_ISR_NAKERR_Pos		29		//A LIN Slave Not Responding Error has been detected, CR.RSTSTA 写 1 清零
#define USART_ISR_NAKERR_Msk		(0x01 << USART_ISR_NAKERR_Pos)
#define USART_ISR_HDRTO_Pos			31		//A LIN Header Timeout Error has been detected, CR.RSTSTA 写 1 清零
#define USART_ISR_HDRTO_Msk			(0x01u<< USART_ISR_HDRTO_Pos)

