Synwit-Co-Ltd/SWM261_Lib/SWM261_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM261.h
	__IO uint32_t FEED;						//写0x55喂狗
} WDT_TypeDef;


#define WDT_CR_EN_Pos				0
#define WDT_CR_EN_Msk				(0x01 << WDT_CR_EN_Pos)
#define WDT_CR_RSTEN_Pos			1
#define WDT_CR_RSTEN_Msk			(0x01 << WDT_CR_RSTEN_Pos)
#define WDT_CR_INTEN_Pos			2
#define WDT_CR_INTEN_Msk			(0x01 << WDT_CR_INTEN_Pos)
#define WDT_CR_WINEN_Pos			3		//Window function enable
#define WDT_CR_WINEN_Msk			(0x01 << WDT_CR_WINEN_Pos)
#define WDT_CR_CLKDIV_Pos			8		//WDT计数时钟分频值 = pow(2, CLKDIV+1)
#define WDT_CR_CLKDIV_Msk			(0x0F << WDT_CR_CLKDIV_Pos)




/******************************************************************************/
/*						 Peripheral memory map							  */
/******************************************************************************/
#define RAM_BASE		   	0x20000000
#define AHB_BASE			0x40000000
#define APB1_BASE		 	0x40040000
#define APB2_BASE			0x400A0000


/* AHB Peripheral memory map */
#define SYS_BASE			(AHB_BASE + 0x00000)

#define DMA_BASE			(AHB_BASE + 0x00800)

#define QSPI0_BASE			(AHB_BASE + 0x01800)

#define CRC_BASE			(AHB_BASE + 0x02800)

#define DIV_BASE			(AHB_BASE + 0x03000)

#define GPIOA_BASE			(AHB_BASE + 0x03800)
#define GPIOB_BASE			(AHB_BASE + 0x04000)
#define GPIOC_BASE			(AHB_BASE + 0x04800)

#define MPU_BASE			(AHB_BASE + 0x05000)


/* APB1 Peripheral memory map */
#define UART0_BASE			(APB1_BASE + 0x0000)
#define UART1_BASE			(APB1_BASE + 0x0800)

#define QEI_BASE			(APB1_BASE + 0x1000)

#define SPI0_BASE			(APB1_BASE + 0x1800)

#define I2C0_BASE			(APB1_BASE + 0x2000)

#define CAN0_BASE			(APB1_BASE + 0x2800)

#define PWM0_BASE			(APB1_BASE + 0x3000)
#define PWM1_BASE			(APB1_BASE + 0x3080)
#define PWMG_BASE			(APB1_BASE + 0x3400)

#define TIMR0_BASE			(APB1_BASE + 0x3800)
#define TIMR1_BASE			(APB1_BASE + 0x3840)
#define TIMR2_BASE			(APB1_BASE + 0x3880)
#define TIMRG_BASE			(APB1_BASE + 0x3C00)

#define BTIMR0_BASE			(APB1_BASE + 0x4000)
#define BTIMR1_BASE			(APB1_BASE + 0x4040)
#define BTIMR2_BASE			(APB1_BASE + 0x4080)
#define BTIMR3_BASE			(APB1_BASE + 0x40C0)
#define BTIMRG_BASE			(APB1_BASE + 0x4400)

#define ADC0_BASE			(APB1_BASE + 0x4800)
#define ADC1_BASE			(APB1_BASE + 0x4900)

#define FMC_BASE			(APB1_BASE + 0x5000)		//Flash Memory Controller

#define PORTA_BASE			(APB1_BASE + 0x6000)
#define PORTB_BASE			(APB1_BASE + 0x6010)
#define PORTC_BASE			(APB1_BASE + 0x6020)

#define WDT_BASE			(APB1_BASE + 0x6800)

#define USART0_BASE			(APB1_BASE + 0x7000)


/******************************************************************************/
/*						 Peripheral declaration							 */
/******************************************************************************/
#define SYS					((SYS_TypeDef  *) SYS_BASE)

#define PORTA				((PORT_TypeDef *) PORTA_BASE)
#define PORTB				((PORT_TypeDef *) PORTB_BASE)
#define PORTC				((PORT_TypeDef *) PORTC_BASE)

#define GPIOA				((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB				((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC				((GPIO_TypeDef *) GPIOC_BASE)

#define TIMR0				((TIMR_TypeDef *) TIMR0_BASE)
#define TIMR1				((TIMR_TypeDef *) TIMR1_BASE)
#define TIMR2				((TIMR_TypeDef *) TIMR2_BASE)
#define TIMRG				((TIMRG_TypeDef*) TIMRG_BASE)

#define BTIMR0				((TIMR_TypeDef *) BTIMR0_BASE)
#define BTIMR1				((TIMR_TypeDef *) BTIMR1_BASE)
#define BTIMR2				((TIMR_TypeDef *) BTIMR2_BASE)
#define BTIMR3				((TIMR_TypeDef *) BTIMR3_BASE)
#define BTIMRG				((TIMRG_TypeDef*) BTIMRG_BASE)

#define UART0				((UART_TypeDef *) UART0_BASE)
#define UART1				((UART_TypeDef *) UART1_BASE)

#define USART0				((USART_TypeDef *)USART0_BASE)

#define QSPI0				((QSPI_TypeDef *) QSPI0_BASE)

#define SPI0				((SPI_TypeDef  *) SPI0_BASE)

#define I2C0				((I2C_TypeDef  *) I2C0_BASE)

#define CAN0				((CAN_TypeDef  *) CAN0_BASE)

#define ADC0 				((ADC_TypeDef  *) ADC0_BASE)
#define ADC1				((ADC_TypeDef  *) ADC1_BASE)

#define PWM0				((PWM_TypeDef  *) PWM0_BASE)
#define PWM1				((PWM_TypeDef  *) PWM1_BASE)
#define PWMG				((PWMG_TypeDef *) PWMG_BASE)

#define DIV					((DIV_TypeDef  *) DIV_BASE)

#define CRC					((CRC_TypeDef  *) CRC_BASE)

#define DMA					((DMA_TypeDef  *) DMA_BASE)

#define MPU					((MPU_TypeDef  *) MPU_BASE)

#define FMC					((FMC_TypeDef  *) FMC_BASE)

#define WDT					((WDT_TypeDef  *) WDT_BASE)

#define QEI					((QEI_TypeDef  *) QEI_BASE)


#include "SWM261_port.h"
#include "SWM261_gpio.h"
#include "SWM261_exti.h"
#include "SWM261_timr.h"
#include "SWM261_uart.h"
#include "SWM261_spi.h"
#include "SWM261_i2c.h"
#include "SWM261_pwm.h"
#include "SWM261_adc.h"
#include "SWM261_dma.h"
#include "SWM261_mpu.h"
#include "SWM261_can.h"
#include "SWM261_div.h"
#include "SWM261_crc.h"
#include "SWM261_wdt.h"
#include "SWM261_qei.h"
#include "SWM261_qspi.h"
#include "SWM261_usart.h"
#include "SWM261_flash.h"
#include "SWM261_iofilt.h"



#ifdef  SW_LOG_RTT
#define log_printf(...)	 	SEGGER_RTT_printf(0, __VA_ARGS__)
#else
#define log_printf(...)	 	printf(__VA_ARGS__)
#endif


#ifndef SW_LOG_LEVEL
#define SW_LOG_LEVEL        0
#endif

#if (SW_LOG_LEVEL > 0)
#define SW_LOG_ERR(...)    	{						 \
							log_printf("ERROR: ");   \
							log_printf(__VA_ARGS__); \
							log_printf("\n");		 \
							}

#if (SW_LOG_LEVEL > 1)
#define SW_LOG_WARN(...) 	{						 \
							log_printf("WARN : ");   \
							log_printf(__VA_ARGS__); \
							log_printf("\n");		 \
							}

#if (SW_LOG_LEVEL > 2)
#define SW_LOG_INFO(...)   	{						 \
							log_printf("INFO : ");   \
							log_printf(__VA_ARGS__); \
							log_printf("\n");		 \
							}
#else
#define SW_LOG_INFO(...)
#endif

#else
#define SW_LOG_WARN(...)
#define SW_LOG_INFO(...)
#endif

#else
#define SW_LOG_ERR(...)
#define SW_LOG_WARN(...)
#define SW_LOG_INFO(...)
#endif


static __INLINE uint32_t SW_enter_critical(void)
{
	uint32_t primask = __get_PRIMASK();
	
	__disable_irq();
	
	return primask;
}

static __INLINE void SW_exit_critical(uint32_t primask)
{
	__set_PRIMASK(primask);
}


#endif //__SWM261_H__
